package com.nenguou.dayuandaily.Model;

/**
 * Created by binguner on 2018/2/15.
 */

public class Class {


    /**
     * code : 1
     * msg : success
     * data : {"id":2465,"term":"2017-2018-2-1","year":2016,"name":"软件1632","college":"软件学院","major":"软件工程","link":null,"data":"{\"0\":{\"0\":\"大学英语(四)_08(明向校区行勉楼,A404,王茹,1-14周上)\",\"1\":\"大学英语(四)_08(明向校区行勉楼,A404,王茹,1-14周上)\",\"4\":\"形势与政策(四)_09(明向校区行知楼,B115,王丽庆,9-13周上)\",\"5\":\"形势与政策(四)_09(明向校区行知楼,B115,王丽庆,9-13周上)\",\"6\":\"硬件技术基础R_08(明向校区行勉楼,C411,赵涓涓,1-14周上)\",\"7\":\"硬件技术基础R_08(明向校区行勉楼,C411,赵涓涓,1-14周上)\"},\"1\":{\"0\":\"算法设计与分析R_08(明向校区行勉楼,C211,阎鹏飞,1-12周上)\",\"1\":\"算法设计与分析R_08(明向校区行勉楼,C211,阎鹏飞,1-12周上)\",\"2\":\"毛泽东思想和中国特色社会主义理论体系概论(一)_12(明向校区行勉楼,A404,杜慧,1-16周上)\",\"3\":\"毛泽东思想和中国特色社会主义理论体系概论(一)_12(明向校区行勉楼,A404,杜慧,1-16周上)\",\"4\":\"数据库系统原理R_08(明向校区行勉楼,C213,曹锐,8-15周上)\",\"5\":\"数据库系统原理R_08(明向校区行勉楼,C213,曹锐,8-15周上)\",\"6\":\"计算机数值方法R_08(明向校区行勉楼,C214,王峥,1-8周上)\",\"7\":\"计算机数值方法R_08(明向校区行勉楼,C214,王峥,1-8周上)\"},\"2\":{\"0\":\"体育(四)_09(明向校区虚拟操场,操场2,详见清单6,1-18周上)\",\"1\":\"体育(四)_09(明向校区虚拟操场,操场2,详见清单6,1-18周上)\",\"2\":\"硬件技术基础R_08(明向校区行勉楼,C311,赵涓涓,1-14周上)\",\"3\":\"硬件技术基础R_08(明向校区行勉楼,C311,赵涓涓,1-14周上)\",\"4\":\"软件工程导论R_08(明向校区行知楼,C332,王爱莲,1-14周上)\",\"5\":\"软件工程导论R_08(明向校区行知楼,C332,王爱莲,1-14周上)\",\"6\":\"计算机数值方法R_08(明向校区行勉楼,C215,王峥,1-8周上)\",\"7\":\"计算机数值方法R_08(明向校区行勉楼,C215,王峥,1-8周上)\"},\"3\":{\"0\":\"大学英语(四)_08(明向校区行勉楼,A404,王茹,1-14周上)\",\"1\":\"大学英语(四)_08(明向校区行勉楼,A404,王茹,1-14周上)\",\"2\":\"英语听力(四)_153(明向校区行知楼,B219,王茹,2,4,6,8,10,12,14,16周上)\",\"3\":\"英语听力(四)_153(明向校区行知楼,B219,王茹,2,4,6,8,10,12,14,16周上)\",\"6\":\"数据库系统原理R_08(明向校区行知楼,C332,曹锐,8-15周上)\",\"7\":\"数据库系统原理R_08(明向校区行知楼,C332,曹锐,8-15周上)\"},\"4\":{\"0\":\"软件工程专业外语R_08(明向校区行勉楼,C310,王丽娟,1-8周上)\",\"1\":\"软件工程专业外语R_08(明向校区行勉楼,C310,王丽娟,1-8周上)\",\"2\":\"数据库系统原理R_08(明向校区行勉楼,C215,曹锐,8-15周上)\",\"3\":\"数据库系统原理R_08(明向校区行勉楼,C215,曹锐,8-15周上)\",\"4\":\"软件工程导论R_08(明向校区行知楼,A106,王爱莲,1-14周上)\",\"5\":\"软件工程导论R_08(明向校区行知楼,A106,王爱莲,1-14周上)\",\"6\":\"算法设计与分析R_08(明向校区行勉楼,C214,阎鹏飞,1-12周上)\",\"7\":\"算法设计与分析R_08(明向校区行勉楼,C214,阎鹏飞,1-12周上)\"},\"5\":{},\"6\":{}}"}
     */

    private int code;
    private String msg;
    private DataBean data;

    public int getCode() {
        return code;
    }

    public void setCode(int code) {
        this.code = code;
    }

    public String getMsg() {
        return msg;
    }

    public void setMsg(String msg) {
        this.msg = msg;
    }

    public DataBean getData() {
        return data;
    }

    public void setData(DataBean data) {
        this.data = data;
    }

    public static class DataBean {
        /**
         * id : 2465
         * term : 2017-2018-2-1
         * year : 2016
         * name : 软件1632
         * college : 软件学院
         * major : 软件工程
         * link : null
         * data : {"0":{"0":"大学英语(四)_08(明向校区行勉楼,A404,王茹,1-14周上)","1":"大学英语(四)_08(明向校区行勉楼,A404,王茹,1-14周上)","4":"形势与政策(四)_09(明向校区行知楼,B115,王丽庆,9-13周上)","5":"形势与政策(四)_09(明向校区行知楼,B115,王丽庆,9-13周上)","6":"硬件技术基础R_08(明向校区行勉楼,C411,赵涓涓,1-14周上)","7":"硬件技术基础R_08(明向校区行勉楼,C411,赵涓涓,1-14周上)"},"1":{"0":"算法设计与分析R_08(明向校区行勉楼,C211,阎鹏飞,1-12周上)","1":"算法设计与分析R_08(明向校区行勉楼,C211,阎鹏飞,1-12周上)","2":"毛泽东思想和中国特色社会主义理论体系概论(一)_12(明向校区行勉楼,A404,杜慧,1-16周上)","3":"毛泽东思想和中国特色社会主义理论体系概论(一)_12(明向校区行勉楼,A404,杜慧,1-16周上)","4":"数据库系统原理R_08(明向校区行勉楼,C213,曹锐,8-15周上)","5":"数据库系统原理R_08(明向校区行勉楼,C213,曹锐,8-15周上)","6":"计算机数值方法R_08(明向校区行勉楼,C214,王峥,1-8周上)","7":"计算机数值方法R_08(明向校区行勉楼,C214,王峥,1-8周上)"},"2":{"0":"体育(四)_09(明向校区虚拟操场,操场2,详见清单6,1-18周上)","1":"体育(四)_09(明向校区虚拟操场,操场2,详见清单6,1-18周上)","2":"硬件技术基础R_08(明向校区行勉楼,C311,赵涓涓,1-14周上)","3":"硬件技术基础R_08(明向校区行勉楼,C311,赵涓涓,1-14周上)","4":"软件工程导论R_08(明向校区行知楼,C332,王爱莲,1-14周上)","5":"软件工程导论R_08(明向校区行知楼,C332,王爱莲,1-14周上)","6":"计算机数值方法R_08(明向校区行勉楼,C215,王峥,1-8周上)","7":"计算机数值方法R_08(明向校区行勉楼,C215,王峥,1-8周上)"},"3":{"0":"大学英语(四)_08(明向校区行勉楼,A404,王茹,1-14周上)","1":"大学英语(四)_08(明向校区行勉楼,A404,王茹,1-14周上)","2":"英语听力(四)_153(明向校区行知楼,B219,王茹,2,4,6,8,10,12,14,16周上)","3":"英语听力(四)_153(明向校区行知楼,B219,王茹,2,4,6,8,10,12,14,16周上)","6":"数据库系统原理R_08(明向校区行知楼,C332,曹锐,8-15周上)","7":"数据库系统原理R_08(明向校区行知楼,C332,曹锐,8-15周上)"},"4":{"0":"软件工程专业外语R_08(明向校区行勉楼,C310,王丽娟,1-8周上)","1":"软件工程专业外语R_08(明向校区行勉楼,C310,王丽娟,1-8周上)","2":"数据库系统原理R_08(明向校区行勉楼,C215,曹锐,8-15周上)","3":"数据库系统原理R_08(明向校区行勉楼,C215,曹锐,8-15周上)","4":"软件工程导论R_08(明向校区行知楼,A106,王爱莲,1-14周上)","5":"软件工程导论R_08(明向校区行知楼,A106,王爱莲,1-14周上)","6":"算法设计与分析R_08(明向校区行勉楼,C214,阎鹏飞,1-12周上)","7":"算法设计与分析R_08(明向校区行勉楼,C214,阎鹏飞,1-12周上)"},"5":{},"6":{}}
         */

        private int id;
        private String term;
        private int year;
        private String name;
        private String college;
        private String major;
        private Object link;
        private String data;

        public int getId() {
            return id;
        }

        public void setId(int id) {
            this.id = id;
        }

        public String getTerm() {
            return term;
        }

        public void setTerm(String term) {
            this.term = term;
        }

        public int getYear() {
            return year;
        }

        public void setYear(int year) {
            this.year = year;
        }

        public String getName() {
            return name;
        }

        public void setName(String name) {
            this.name = name;
        }

        public String getCollege() {
            return college;
        }

        public void setCollege(String college) {
            this.college = college;
        }

        public String getMajor() {
            return major;
        }

        public void setMajor(String major) {
            this.major = major;
        }

        public Object getLink() {
            return link;
        }

        public void setLink(Object link) {
            this.link = link;
        }

        public String getData() {
            return data;
        }

        public void setData(String data) {
            this.data = data;
        }
    }
}
